GA_HeatTransfer/CFD/0/thicknessFraction
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thicknessFraction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            symmetryPlane;
    }
    bottom
    {
        type            symmetryPlane;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    Surface1
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
368
(
0.995789
1
0.999696
0.999915
0.995864
0.999928
0.999992
1
...
)
;
    }
    Surface2
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
368
(
1.00001
1
1
0.999696
0.999696
0.999972
1.00003
1.00003
...
)
;
    }
    Surface3
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
368
(
0.995789
1
0.999696
0.999915
0.995864
0.999928
0.999992
1
...
)
;
    }
    Surface4
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
736
(
0.995791
1
1.00001
1
0.999696
0.999696
0.999696
1
...
)
;
    }
}


// ************************************************************************* //
