GA_HeatTransfer/CFD/system/include/Dimensions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

OD			0.01;

//OD1			#calc "-$OD";
//ODmid			#calc "$OD/1.41421356237";
//ODmid1			#calc "-$OD/1.41421356237";


Xmin	     		#calc "-$OD*6";	
Xmax1			#calc "$OD*9";
Xmax2			#calc "$OD*24";
Y             		#calc "$OD*1.5";	
Z			0.001;


Y1             		#calc "-$Y";	
Z1			#calc "-$Z";








turbulentKE          0.09375;//37
turbulentOmega       6;//7.53887;//1.61;//32


// ************************************************************************* //
